{"class_name": "Model", "config": {"name": "model_1", "layers": [{"name": "data", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 224, 224, 3], "dtype": "float32", "sparse": false, "name": "data"}, "inbound_nodes": []}, {"name": "zero_padding2d_1", "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_1", "trainable": true, "padding": [[3, 3], [3, 3]], "data_format": "channels_last"}, "inbound_nodes": [[["data", 0, 0, {}]]]}, {"name": "conv_1", "class_name": "Conv2D", "config": {"name": "conv_1", "trainable": true, "filters": 64, "kernel_size": [7, 7], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_1", 0, 0, {}]]]}, {"name": "bn_1", "class_name": "BatchNormalization", "config": {"name": "bn_1", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv_1", 0, 0, {}]]]}, {"name": "relu_1", "class_name": "Activation", "config": {"name": "relu_1", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn_1", 0, 0, {}]]]}, {"name": "zero_padding2d_2", "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_2", "trainable": true, "padding": [[0, 1], [0, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["relu_1", 0, 0, {}]]]}, {"name": "pool1", "class_name": "MaxPooling2D", "config": {"name": "pool1", "trainable": true, "pool_size": [3, 3], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["zero_padding2d_2", 0, 0, {}]]]}, {"name": "conv_stage0_block0_branch2a", "class_name": "Conv2D", "config": {"name": "conv_stage0_block0_branch2a", "trainable": true, "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["pool1", 0, 0, {}]]]}, {"name": "bn_stage0_block0_branch2a", "class_name": "BatchNormalization", "config": {"name": "bn_stage0_block0_branch2a", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv_stage0_block0_branch2a", 0, 0, {}]]]}, {"name": "relu_stage0_block0_branch2a", "class_name": "Activation", "config": {"name": "relu_stage0_block0_branch2a", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn_stage0_block0_branch2a", 0, 0, {}]]]}, {"name": "zero_padding2d_3", "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_3", "trainable": true, "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["relu_stage0_block0_branch2a", 0, 0, {}]]]}, {"name": "conv_stage0_block0_branch2b", "class_name": "Conv2D", "config": {"name": "conv_stage0_block0_branch2b", "trainable": true, "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_3", 0, 0, {}]]]}, {"name": "bn_stage0_block0_branch2b", "class_name": "BatchNormalization", "config": {"name": "bn_stage0_block0_branch2b", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv_stage0_block0_branch2b", 0, 0, {}]]]}, {"name": "relu_stage0_block0_branch2b", "class_name": "Activation", "config": {"name": "relu_stage0_block0_branch2b", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn_stage0_block0_branch2b", 0, 0, {}]]]}, {"name": "conv_stage0_block0_proj_shortcut", "class_name": "Conv2D", "config": {"name": "conv_stage0_block0_proj_shortcut", "trainable": true, "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["pool1", 0, 0, {}]]]}, {"name": "conv_stage0_block0_branch2c", "class_name": "Conv2D", "config": {"name": "conv_stage0_block0_branch2c", "trainable": true, "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["relu_stage0_block0_branch2b", 0, 0, {}]]]}, {"name": "bn_stage0_block0_proj_shortcut", "class_name": "BatchNormalization", "config": {"name": "bn_stage0_block0_proj_shortcut", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv_stage0_block0_proj_shortcut", 0, 0, {}]]]}, {"name": "bn_stage0_block0_branch2c", "class_name": "BatchNormalization", "config": {"name": "bn_stage0_block0_branch2c", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv_stage0_block0_branch2c", 0, 0, {}]]]}, {"name": "eltwise_stage0_block0", "class_name": "Add", "config": {"name": "eltwise_stage0_block0", "trainable": true}, "inbound_nodes": [[["bn_stage0_block0_proj_shortcut", 0, 0, {}], ["bn_stage0_block0_branch2c", 0, 0, {}]]]}, {"name": "relu_stage0_block0", "class_name": "Activation", "config": {"name": "relu_stage0_block0", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["eltwise_stage0_block0", 0, 0, {}]]]}, {"name": "conv_stage0_block1_branch2a", "class_name": "Conv2D", "config": {"name": "conv_stage0_block1_branch2a", "trainable": true, "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["relu_stage0_block0", 0, 0, {}]]]}, {"name": "bn_stage0_block1_branch2a", "class_name": "BatchNormalization", "config": {"name": "bn_stage0_block1_branch2a", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv_stage0_block1_branch2a", 0, 0, {}]]]}, {"name": "relu_stage0_block1_branch2a", "class_name": "Activation", "config": {"name": "relu_stage0_block1_branch2a", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn_stage0_block1_branch2a", 0, 0, {}]]]}, {"name": "zero_padding2d_4", "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_4", "trainable": true, "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["relu_stage0_block1_branch2a", 0, 0, {}]]]}, {"name": "conv_stage0_block1_branch2b", "class_name": "Conv2D", "config": {"name": "conv_stage0_block1_branch2b", "trainable": true, "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_4", 0, 0, {}]]]}, {"name": "bn_stage0_block1_branch2b", "class_name": "BatchNormalization", "config": {"name": "bn_stage0_block1_branch2b", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv_stage0_block1_branch2b", 0, 0, {}]]]}, {"name": "relu_stage0_block1_branch2b", "class_name": "Activation", "config": {"name": "relu_stage0_block1_branch2b", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn_stage0_block1_branch2b", 0, 0, {}]]]}, {"name": "conv_stage0_block1_branch2c", "class_name": "Conv2D", "config": {"name": "conv_stage0_block1_branch2c", "trainable": true, "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["relu_stage0_block1_branch2b", 0, 0, {}]]]}, {"name": "bn_stage0_block1_branch2c", "class_name": "BatchNormalization", "config": {"name": "bn_stage0_block1_branch2c", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv_stage0_block1_branch2c", 0, 0, {}]]]}, {"name": "eltwise_stage0_block1", "class_name": "Add", "config": {"name": "eltwise_stage0_block1", "trainable": true}, "inbound_nodes": [[["relu_stage0_block0", 0, 0, {}], ["bn_stage0_block1_branch2c", 0, 0, {}]]]}, {"name": "relu_stage0_block1", "class_name": "Activation", "config": {"name": "relu_stage0_block1", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["eltwise_stage0_block1", 0, 0, {}]]]}, {"name": "conv_stage0_block2_branch2a", "class_name": "Conv2D", "config": {"name": "conv_stage0_block2_branch2a", "trainable": true, "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["relu_stage0_block1", 0, 0, {}]]]}, {"name": "bn_stage0_block2_branch2a", "class_name": "BatchNormalization", "config": {"name": "bn_stage0_block2_branch2a", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv_stage0_block2_branch2a", 0, 0, {}]]]}, {"name": "relu_stage0_block2_branch2a", "class_name": "Activation", "config": {"name": "relu_stage0_block2_branch2a", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn_stage0_block2_branch2a", 0, 0, {}]]]}, {"name": "zero_padding2d_5", "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_5", "trainable": true, "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["relu_stage0_block2_branch2a", 0, 0, {}]]]}, {"name": "conv_stage0_block2_branch2b", "class_name": "Conv2D", "config": {"name": "conv_stage0_block2_branch2b", "trainable": true, "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_5", 0, 0, {}]]]}, {"name": "bn_stage0_block2_branch2b", "class_name": "BatchNormalization", "config": {"name": "bn_stage0_block2_branch2b", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv_stage0_block2_branch2b", 0, 0, {}]]]}, {"name": "relu_stage0_block2_branch2b", "class_name": "Activation", "config": {"name": "relu_stage0_block2_branch2b", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn_stage0_block2_branch2b", 0, 0, {}]]]}, {"name": "conv_stage0_block2_branch2c", "class_name": "Conv2D", "config": {"name": "conv_stage0_block2_branch2c", "trainable": true, "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["relu_stage0_block2_branch2b", 0, 0, {}]]]}, {"name": "bn_stage0_block2_branch2c", "class_name": "BatchNormalization", "config": {"name": "bn_stage0_block2_branch2c", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv_stage0_block2_branch2c", 0, 0, {}]]]}, {"name": "eltwise_stage0_block2", "class_name": "Add", "config": {"name": "eltwise_stage0_block2", "trainable": true}, "inbound_nodes": [[["relu_stage0_block1", 0, 0, {}], ["bn_stage0_block2_branch2c", 0, 0, {}]]]}, {"name": "relu_stage0_block2", "class_name": "Activation", "config": {"name": "relu_stage0_block2", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["eltwise_stage0_block2", 0, 0, {}]]]}, {"name": "conv_stage1_block0_branch2a", "class_name": "Conv2D", "config": {"name": "conv_stage1_block0_branch2a", "trainable": true, "filters": 64, "kernel_size": [1, 1], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["relu_stage0_block2", 0, 0, {}]]]}, {"name": "bn_stage1_block0_branch2a", "class_name": "BatchNormalization", "config": {"name": "bn_stage1_block0_branch2a", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv_stage1_block0_branch2a", 0, 0, {}]]]}, {"name": "relu_stage1_block0_branch2a", "class_name": "Activation", "config": {"name": "relu_stage1_block0_branch2a", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn_stage1_block0_branch2a", 0, 0, {}]]]}, {"name": "zero_padding2d_6", "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_6", "trainable": true, "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["relu_stage1_block0_branch2a", 0, 0, {}]]]}, {"name": "conv_stage1_block0_branch2b", "class_name": "Conv2D", "config": {"name": "conv_stage1_block0_branch2b", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_6", 0, 0, {}]]]}, {"name": "bn_stage1_block0_branch2b", "class_name": "BatchNormalization", "config": {"name": "bn_stage1_block0_branch2b", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv_stage1_block0_branch2b", 0, 0, {}]]]}, {"name": "relu_stage1_block0_branch2b", "class_name": "Activation", "config": {"name": "relu_stage1_block0_branch2b", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn_stage1_block0_branch2b", 0, 0, {}]]]}, {"name": "conv_stage1_block0_proj_shortcut", "class_name": "Conv2D", "config": {"name": "conv_stage1_block0_proj_shortcut", "trainable": true, "filters": 256, "kernel_size": [1, 1], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["relu_stage0_block2", 0, 0, {}]]]}, {"name": "conv_stage1_block0_branch2c", "class_name": "Conv2D", "config": {"name": "conv_stage1_block0_branch2c", "trainable": true, "filters": 256, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["relu_stage1_block0_branch2b", 0, 0, {}]]]}, {"name": "bn_stage1_block0_proj_shortcut", "class_name": "BatchNormalization", "config": {"name": "bn_stage1_block0_proj_shortcut", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv_stage1_block0_proj_shortcut", 0, 0, {}]]]}, {"name": "bn_stage1_block0_branch2c", "class_name": "BatchNormalization", "config": {"name": "bn_stage1_block0_branch2c", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv_stage1_block0_branch2c", 0, 0, {}]]]}, {"name": "eltwise_stage1_block0", "class_name": "Add", "config": {"name": "eltwise_stage1_block0", "trainable": true}, "inbound_nodes": [[["bn_stage1_block0_proj_shortcut", 0, 0, {}], ["bn_stage1_block0_branch2c", 0, 0, {}]]]}, {"name": "relu_stage1_block0", "class_name": "Activation", "config": {"name": "relu_stage1_block0", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["eltwise_stage1_block0", 0, 0, {}]]]}, {"name": "conv_stage1_block1_branch2a", "class_name": "Conv2D", "config": {"name": "conv_stage1_block1_branch2a", "trainable": true, "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["relu_stage1_block0", 0, 0, {}]]]}, {"name": "bn_stage1_block1_branch2a", "class_name": "BatchNormalization", "config": {"name": "bn_stage1_block1_branch2a", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv_stage1_block1_branch2a", 0, 0, {}]]]}, {"name": "relu_stage1_block1_branch2a", "class_name": "Activation", "config": {"name": "relu_stage1_block1_branch2a", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn_stage1_block1_branch2a", 0, 0, {}]]]}, {"name": "zero_padding2d_7", "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_7", "trainable": true, "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["relu_stage1_block1_branch2a", 0, 0, {}]]]}, {"name": "conv_stage1_block1_branch2b", "class_name": "Conv2D", "config": {"name": "conv_stage1_block1_branch2b", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_7", 0, 0, {}]]]}, {"name": "bn_stage1_block1_branch2b", "class_name": "BatchNormalization", "config": {"name": "bn_stage1_block1_branch2b", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv_stage1_block1_branch2b", 0, 0, {}]]]}, {"name": "relu_stage1_block1_branch2b", "class_name": "Activation", "config": {"name": "relu_stage1_block1_branch2b", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn_stage1_block1_branch2b", 0, 0, {}]]]}, {"name": "conv_stage1_block1_branch2c", "class_name": "Conv2D", "config": {"name": "conv_stage1_block1_branch2c", "trainable": true, "filters": 256, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["relu_stage1_block1_branch2b", 0, 0, {}]]]}, {"name": "bn_stage1_block1_branch2c", "class_name": "BatchNormalization", "config": {"name": "bn_stage1_block1_branch2c", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv_stage1_block1_branch2c", 0, 0, {}]]]}, {"name": "eltwise_stage1_block1", "class_name": "Add", "config": {"name": "eltwise_stage1_block1", "trainable": true}, "inbound_nodes": [[["relu_stage1_block0", 0, 0, {}], ["bn_stage1_block1_branch2c", 0, 0, {}]]]}, {"name": "relu_stage1_block1", "class_name": "Activation", "config": {"name": "relu_stage1_block1", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["eltwise_stage1_block1", 0, 0, {}]]]}, {"name": "conv_stage1_block2_branch2a", "class_name": "Conv2D", "config": {"name": "conv_stage1_block2_branch2a", "trainable": true, "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["relu_stage1_block1", 0, 0, {}]]]}, {"name": "bn_stage1_block2_branch2a", "class_name": "BatchNormalization", "config": {"name": "bn_stage1_block2_branch2a", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv_stage1_block2_branch2a", 0, 0, {}]]]}, {"name": "relu_stage1_block2_branch2a", "class_name": "Activation", "config": {"name": "relu_stage1_block2_branch2a", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn_stage1_block2_branch2a", 0, 0, {}]]]}, {"name": "zero_padding2d_8", "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_8", "trainable": true, "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["relu_stage1_block2_branch2a", 0, 0, {}]]]}, {"name": "conv_stage1_block2_branch2b", "class_name": "Conv2D", "config": {"name": "conv_stage1_block2_branch2b", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_8", 0, 0, {}]]]}, {"name": "bn_stage1_block2_branch2b", "class_name": "BatchNormalization", "config": {"name": "bn_stage1_block2_branch2b", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv_stage1_block2_branch2b", 0, 0, {}]]]}, {"name": "relu_stage1_block2_branch2b", "class_name": "Activation", "config": {"name": "relu_stage1_block2_branch2b", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn_stage1_block2_branch2b", 0, 0, {}]]]}, {"name": "conv_stage1_block2_branch2c", "class_name": "Conv2D", "config": {"name": "conv_stage1_block2_branch2c", "trainable": true, "filters": 256, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["relu_stage1_block2_branch2b", 0, 0, {}]]]}, {"name": "bn_stage1_block2_branch2c", "class_name": "BatchNormalization", "config": {"name": "bn_stage1_block2_branch2c", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv_stage1_block2_branch2c", 0, 0, {}]]]}, {"name": "eltwise_stage1_block2", "class_name": "Add", "config": {"name": "eltwise_stage1_block2", "trainable": true}, "inbound_nodes": [[["relu_stage1_block1", 0, 0, {}], ["bn_stage1_block2_branch2c", 0, 0, {}]]]}, {"name": "relu_stage1_block2", "class_name": "Activation", "config": {"name": "relu_stage1_block2", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["eltwise_stage1_block2", 0, 0, {}]]]}, {"name": "conv_stage1_block3_branch2a", "class_name": "Conv2D", "config": {"name": "conv_stage1_block3_branch2a", "trainable": true, "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["relu_stage1_block2", 0, 0, {}]]]}, {"name": "bn_stage1_block3_branch2a", "class_name": "BatchNormalization", "config": {"name": "bn_stage1_block3_branch2a", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv_stage1_block3_branch2a", 0, 0, {}]]]}, {"name": "relu_stage1_block3_branch2a", "class_name": "Activation", "config": {"name": "relu_stage1_block3_branch2a", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn_stage1_block3_branch2a", 0, 0, {}]]]}, {"name": "zero_padding2d_9", "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_9", "trainable": true, "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["relu_stage1_block3_branch2a", 0, 0, {}]]]}, {"name": "conv_stage1_block3_branch2b", "class_name": "Conv2D", "config": {"name": "conv_stage1_block3_branch2b", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_9", 0, 0, {}]]]}, {"name": "bn_stage1_block3_branch2b", "class_name": "BatchNormalization", "config": {"name": "bn_stage1_block3_branch2b", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv_stage1_block3_branch2b", 0, 0, {}]]]}, {"name": "relu_stage1_block3_branch2b", "class_name": "Activation", "config": {"name": "relu_stage1_block3_branch2b", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn_stage1_block3_branch2b", 0, 0, {}]]]}, {"name": "conv_stage1_block3_branch2c", "class_name": "Conv2D", "config": {"name": "conv_stage1_block3_branch2c", "trainable": true, "filters": 256, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["relu_stage1_block3_branch2b", 0, 0, {}]]]}, {"name": "bn_stage1_block3_branch2c", "class_name": "BatchNormalization", "config": {"name": "bn_stage1_block3_branch2c", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv_stage1_block3_branch2c", 0, 0, {}]]]}, {"name": "eltwise_stage1_block3", "class_name": "Add", "config": {"name": "eltwise_stage1_block3", "trainable": true}, "inbound_nodes": [[["relu_stage1_block2", 0, 0, {}], ["bn_stage1_block3_branch2c", 0, 0, {}]]]}, {"name": "relu_stage1_block3", "class_name": "Activation", "config": {"name": "relu_stage1_block3", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["eltwise_stage1_block3", 0, 0, {}]]]}, {"name": "conv_stage2_block0_branch2a", "class_name": "Conv2D", "config": {"name": "conv_stage2_block0_branch2a", "trainable": true, "filters": 128, "kernel_size": [1, 1], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["relu_stage1_block3", 0, 0, {}]]]}, {"name": "bn_stage2_block0_branch2a", "class_name": "BatchNormalization", "config": {"name": "bn_stage2_block0_branch2a", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv_stage2_block0_branch2a", 0, 0, {}]]]}, {"name": "relu_stage2_block0_branch2a", "class_name": "Activation", "config": {"name": "relu_stage2_block0_branch2a", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn_stage2_block0_branch2a", 0, 0, {}]]]}, {"name": "zero_padding2d_10", "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_10", "trainable": true, "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["relu_stage2_block0_branch2a", 0, 0, {}]]]}, {"name": "conv_stage2_block0_branch2b", "class_name": "Conv2D", "config": {"name": "conv_stage2_block0_branch2b", "trainable": true, "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_10", 0, 0, {}]]]}, {"name": "bn_stage2_block0_branch2b", "class_name": "BatchNormalization", "config": {"name": "bn_stage2_block0_branch2b", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv_stage2_block0_branch2b", 0, 0, {}]]]}, {"name": "relu_stage2_block0_branch2b", "class_name": "Activation", "config": {"name": "relu_stage2_block0_branch2b", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn_stage2_block0_branch2b", 0, 0, {}]]]}, {"name": "conv_stage2_block0_proj_shortcut", "class_name": "Conv2D", "config": {"name": "conv_stage2_block0_proj_shortcut", "trainable": true, "filters": 512, "kernel_size": [1, 1], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["relu_stage1_block3", 0, 0, {}]]]}, {"name": "conv_stage2_block0_branch2c", "class_name": "Conv2D", "config": {"name": "conv_stage2_block0_branch2c", "trainable": true, "filters": 512, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["relu_stage2_block0_branch2b", 0, 0, {}]]]}, {"name": "bn_stage2_block0_proj_shortcut", "class_name": "BatchNormalization", "config": {"name": "bn_stage2_block0_proj_shortcut", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv_stage2_block0_proj_shortcut", 0, 0, {}]]]}, {"name": "bn_stage2_block0_branch2c", "class_name": "BatchNormalization", "config": {"name": "bn_stage2_block0_branch2c", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv_stage2_block0_branch2c", 0, 0, {}]]]}, {"name": "eltwise_stage2_block0", "class_name": "Add", "config": {"name": "eltwise_stage2_block0", "trainable": true}, "inbound_nodes": [[["bn_stage2_block0_proj_shortcut", 0, 0, {}], ["bn_stage2_block0_branch2c", 0, 0, {}]]]}, {"name": "relu_stage2_block0", "class_name": "Activation", "config": {"name": "relu_stage2_block0", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["eltwise_stage2_block0", 0, 0, {}]]]}, {"name": "conv_stage2_block1_branch2a", "class_name": "Conv2D", "config": {"name": "conv_stage2_block1_branch2a", "trainable": true, "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["relu_stage2_block0", 0, 0, {}]]]}, {"name": "bn_stage2_block1_branch2a", "class_name": "BatchNormalization", "config": {"name": "bn_stage2_block1_branch2a", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv_stage2_block1_branch2a", 0, 0, {}]]]}, {"name": "relu_stage2_block1_branch2a", "class_name": "Activation", "config": {"name": "relu_stage2_block1_branch2a", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn_stage2_block1_branch2a", 0, 0, {}]]]}, {"name": "zero_padding2d_11", "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_11", "trainable": true, "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["relu_stage2_block1_branch2a", 0, 0, {}]]]}, 